app/controllers/candidates_controller.rb

SELECT * FROM "candidates"
---
  def index
    @candidates = Candidate.all

SELECT * FROM "candidates" WHERE ("candidates"."id" = 1)
---
  def show
    @candidate = Candidate.find(params[:id])

SELECT * FROM "candidates" WHERE ("candidates"."id" = 1)
---
  def edit
    @candidate = Candidate.find(params[:id])

INSERT INTO "candidates" ("name", "created_at", "ruby_course", "updated_at", "contact", "rails_course") VALUES('ABC', '2009-04-04 16:28:28', 't', '2009-04-04 16:28:28', 'CCC', 't')
---
  def create
    @candidate = Candidate.new(params[:candidate])

    respond_to do |format|
      if @candidate.save

SELECT * FROM "candidates" WHERE ("candidates"."id" = 1)
UPDATE "candidates" SET "rails_course" = 't', "updated_at" = '2009-04-04 17:54:53', "ruby_course" = 't', "name" = 'mafagafo', "contact" = 'mafagafo' WHERE "id" = 2
---
  def update
    @candidate = Candidate.find(params[:id])

    respond_to do |format|
      if @candidate.update_attributes(params[:candidate])