app/controllers/run_controller.rb

SELECT * FROM "candidates"
---
  def index
    @ruby_winner = nil
    @rails_winner = nil
    session[:candidates] = Candidate.all.shuffle if session[:candidates].nil?